In [1]:
import sqlite3

In [2]:
connect = sqlite3.connect('mahasiswa.db')
cursor = connect.cursor()

In [3]:
cursor.execute('''
    CREATE TABLE IF NOT EXISTS Mahasiswa(
        ID_Mahasiswa INT PRIMARY KEY,
        Nama TEXT,
        Jurusan TEXT,
        Tanggal_Lahir DATE,
        Alamat TEXT,
        No_Telp TEXT
    )
''')

In [4]:
cursor.execute('''
    CREATE TABLE IF NOT EXISTS MataKuliah(
        Kode_MataKuliah TEXT PRIMARY KEY,
        Nama_MataKuliah TEXT,
        SKS INT
    )
''')

In [5]:
cursor.execute('''
    CREATE TABLE IF NOT EXISTS Dosen(
        ID_Dosen INT PRIMARY KEY,
        Nama_Dosen TEXT,
        Bidang_Ahli TEXT
    )
''')

In [6]:
import pandas as pd

/tmp/ipykernel_27311/4080736814.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

######## Show data Mahasiswa

In [7]:
query = 'SELECT * FROM Mahasiswa'

data = pd.read_sql_query(query, connect)
data

Empty DataFrame
Columns: [ID_Mahasiswa, Nama, Jurusan, Tanggal_Lahir, Alamat, No_Telp]
Index: []

In [8]:
Mahasiswa = [
    (1, 'Adi', 'Informatika', '2022-02-02', 'Jl. Apel', '08888888'),
    (2, 'Ada', 'Bidan', '2012-12-12', 'Jl. Anggur Merah', '08121212'),
    (3, 'Ali', 'Sospol', '2018-08-08', 'Jl. Kampang', '08080808'),
]

for data in Mahasiswa:
    cursor.execute('''
    INSERT INTO Mahasiswa(
        ID_Mahasiswa,
        Nama,
        Jurusan,
        Tanggal_Lahir,
        Alamat,
        No_Telp
    ) VALUES (?,?,?,?,?,?)''', data)

connect.commit()
connect.close()

In [9]:
query = 'SELECT * FROM Mahasiswa'

data = pd.read_sql_query(query, connect)
data

   ID_Mahasiswa Nama      Jurusan Tanggal_Lahir            Alamat   No_Telp
0             1  Adi  Informatika    2022-02-02          Jl. Apel  08888888
1             2  Ada        Bidan    2012-12-12  Jl. Anggur Merah  08121212
2             3  Ali       Sospol    2018-08-08       Jl. Kampang  08080808

######### Show Data mata Kuliah

In [10]:
query = 'SELECT * FROM MataKuliah'

data = pd.read_sql_query(query, connect)
data

Empty DataFrame
Columns: [Kode_MataKuliah, Nama_MataKuliah, SKS]
Index: []

In [11]:
cursor = connect.cursor()

MataKuliah = [
    ('IF-200-21', 'Bahasa & Automata', 2),
    ('IF-201-21', 'Kalkulus', 23),
    ('IF-202-21', 'Struktur Data Praktik', 4)
]

for data in MataKuliah:
    cursor.execute('''
    INSERT INTO MataKuliah(
        Kode_MataKuliah,
        Nama_MataKuliah,
        SKS
    ) VALUES (?,?,?)''', data)

connect.commit()
connect.close()

In [12]:
query = 'SELECT * FROM MataKuliah'

data = pd.read_sql_query(query, connect)
data

  Kode_MataKuliah        Nama_MataKuliah  SKS
0       IF-200-21      Bahasa & Automata    2
1       IF-201-21               Kalkulus   23
2       IF-202-21  Struktur Data Praktik    4

######### Show Data mata Kuliah

In [13]:
query = 'SELECT * FROM Dosen'

data = pd.read_sql_query(query, connect)
data

Empty DataFrame
Columns: [ID_Dosen, Nama_Dosen, Bidang_Ahli]
Index: []

In [14]:
cursor = connect.cursor()

Dosen = [
    (1, 'Ledy Elsera Astrianty', 'Teori'),
    (2, 'Selfi Artika', 'Teori'),
    (3, 'Dyah Mukarromah', 'Teori')
]

for data in Dosen:
    cursor.execute('''
        INSERT INTO Dosen(
            ID_Dosen,
            Nama_Dosen,
            Bidang_Ahli
        ) VALUES (?,?,?)''', data
    )

connect.commit()
connect.close()

In [15]:
query = 'SELECT * FROM Dosen'

data = pd.read_sql_query(query, connect)
data

   ID_Dosen             Nama_Dosen Bidang_Ahli
0         1  Ledy Elsera Astrianty       Teori
1         2           Selfi Artika       Teori
2         3        Dyah Mukarromah       Teori